{
	"notFound": "Страница не найдена",
	"header": {
		"main": "Главная",
		"aboutMe": "Обо мне",
		"projects": "Мои проекты"
	},
	"infoBlock": {
		"hello": "Привет! Меня зовут",
		"name": "Александр",
		"nextInfo": "и я",
		"frontend": "Frontend developer"
	},
	"About me":"Обо мне",
	"I am Alexander. I live in Dzerzhinsk, Nizhny Novgorod region. I started immersing myself in IT 4 years ago from learning C#, later moved to frontend and a year later started my career as a layout designer on a freelance exchange.":"Я Александр. Живу в Дзержинске Нижегородской области. Начал погружаться в IT 4 года назад с изучения C#, позже пересел на frontend и через год начал карьеру верстальщиком на фриланс бирже.",
	"Studied new technologies and later switched to React. I found my first job in a team, where I improved my skills in both development and communication skills in joint development to achieve common goals. He has also worked on various projects ranging from simple Django template development to a large website builder.":"Изучал новые технологии и позже перешел на React. Нашел первую работу в команде, где поднял свои скилы как в разработке, так и навыки коммуникаций в совместной разработке для достижения общих целей. Также работал в различных проектах, начиная от разработки обычных шаблонов под Django, до крупного конструктора сайтов.",
	"I have a bachelor's degree in space information systems and technologies from NNSTU. Currently, I continue to study new technologies and best practices to write better, more maintainable and readable code. Open for new various offers, both for full-time and project work in a friendly team :). Always in touch.":"Имею степень бакалавра по направлению Информационные системы и технологии НГТУ. В настоящее время продолжаю изучать новые технологии и best practices, для написания всё более качественного, поддерживаемого и читаемого кода. Открыт для новых различных предложений, как на полноценную, так и на проектную работу в дружелюбный коллектив :). Всегда на связи.",
	
	"Development stack2": "Мой стек",
	"My experience": "Мой опыт",
	"Job responsibilities":"Должностные обязанности",
	"Development stack": "Стек разработки",
	"Achievements": "Достижения",
	"job": {
		"first": {
			"date": "Сентябрь 2022 - Июнь 2023",
			"nameJob": "Конструктор сайтов",
			"description": "Проектная работа. Разработка аналогов существующих конструкторов с использованием dran'n'drop для перемещения элементов.",
			"stack": {
				"1": "TypeScript",
				"2": "React",
				"3": "Mobx",
				"4": "i18n",
				"5": "react-dnd",
				"6": "rect-hook-form",
				"7": "styled-components"
			},
			"requiredJob": {
				"1": "Разработка конструктора и профиля пользователя",
				"2": "Написание логики приложения",
				"3": "Написание адаптивной и кроссбраузерной верстки по макету с Figma",
				"4": "Проведение код ревью"
			},
			"achievepments": "Оптимизировал алгоритм обновления объекта большой вложенности, что увеличило производительность на ~60%"
		},
		"second": {
			"date": "Апрель 2022 - Август 2022",
			"nameJob": "Маркетплейс",
			"description": "Проектная работа, разработка маркетплейса.",
			"stack": { "1": "TypeScript", "2": "React", "3": "Redux Toolkit", "4": "rect-hook-form", "5": "scss" },
			"requiredJob": {
				"1": "Разработка страниц товаров и списка категорий",
				"2": "Разработка админ-панели",
				"3": "Написание логики приложения",
				"4": "Рефакторинг кода"
			},
			"achievepments": "Интегрировал в основное приложение новую часть функционала из другого приложения"
		},
		"third": {
			"date": "Сентябрь 2021 - Март 2022",
			"nameJob": "Корпоративный сайт",
			"description": "Проектная работа в ООО Имэкс, разработка сайта для сотрудников.",
			"stack": { "1": "Django", "2": "TypeScript", "3": "scss" },
			"requiredJob": {
				"1": "Верстка доступных, семантических страниц",
				"2": "Написание логики приложения",
				"3": "Адаптивная и кроссбраузерная верстка",
				"4": "Разработка дизайна сайта",
				"5": "Работа с legacy кодом",
				"6": "Рефакторинг чужого кода"
			},
			"achievepments": "Улучшил семантику и доступность на уже существующих страницах"
		},
		"four": {
			"date": "Июнь 2021 - Август 2021",
			"nameJob": "Регистрация интеллектуальной собственности",
			"description": "Стажировка в АО НИИК.",
			"stack": { "1": "React", "2": "TypeScript", "3": "MUI", "4": "Redux Toolkit", "5": "Formik" },
			"requiredJob": { "1": "Написание логики приложения", "2": "Адаптивная и кроссбраузерная верстка" },
			"achievepments": ""
		}
	},
	"My projects":"Мои проекты",
	"More": "Подробнее",
	"visit": "Посмотреть",
	"back": "Вернуться",
	"projects": {
		"project": {
			"1": {
				"name": "Проигрыватель песен",
				"description": "Кастомный плеер для проигрывания музыки. Необходимо вставить ссылку в поле ввода, ее взять в описании проекта на GitHub."
			},
			"2": {
				"name": "Расширение для ВКонтакте спам реакциями",
				"description": "'Достай соседа', при включении скрипта на каждое сообщение указанного пользователя будет ставится выбранная реакция."
			},
			"3": {
				"name": "Расширение для ВКонтакте документов",
				"description": "Комфортный просмотр gif файлов, по сравнению с оригиналом."
			},
			"4": {
				"name": "Калькулятор для игры",
				"description": "Калькулятор для игры Genshin Impact. Позволяет рассчитывать валюту для сохранения на будущих героев и остаток от расчеты счиитается свободными для трат. Также есть таблица для отслеживания изменения количества валюты. Также есть страница для прочтения лора игры. Сайт полностью адаптивен."
			},
			"5": {
				"name": "API игр",
				"description": "Список игр с фильтрацией и сортировкой. Также есть отдельные страницы для каждой игры со своей информацией."
			},
			"6": {
				"name": "Интернет магазин",
				"description": "Обычный интернет магазин с категориями и подкатегориями. Поиск товаров, фильтрация, сортировка, профиль, корзина, любимые товары, реализовано на firebase. Адаптивен для всех размеров."
			},
			"7": {
				"name": "Конструктор мобильных приложений",
				"description": "Конструктор мобильных приложений при помощи drag'n'drop и готовых компонентов, что позволяет ускорить разработку. Также есть кастомизация готовых компонентов под нужды пользователя."
			}
		}
	}
}
